/*
******************************************************************************
* 文 件 名 ：  WDG_TASK.h
* 描    述 ：  喂狗处理
* 硬件平台 ：  SMD201-BLDC
******************************************************************************
*/
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef      _WDG_TASK_H
  #define    _WDG_TASK_H

/*
******************************************************************************
*引用限制说明
******************************************************************************
*/
#ifdef      WDG_TASK_GLOBALS
  #define   WDG_TASK_EXT
#else
  #define   WDG_TASK_EXT    extern
#endif
/*
******************************************************************************
*函数声明
******************************************************************************
*/
//WDG_TASK_EXT void FeedWatchDog_Op(void);
WDG_TASK_EXT void IWDG_Init(u8 prer,u16 rlr);
//WDG_TASK_EXT void IWDG_Init();
WDG_TASK_EXT void IWDG_Feed(void);
WDG_TASK_EXT void FeedWatchDog_Op(void);
WDG_TASK_EXT void Wdt_StopFeedDog(void);
/*
******************************************************************************
*WDG_TASK.h定义结束
******************************************************************************
*/
#endif